cluster-test-slaves.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.8" jmeter="2.13 r1665067">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test plan Staging Percona cluster" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="candidate-prod-connections" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <longProp name="ThreadGroup.start_time">1439499658000</longProp>
        <longProp name="ThreadGroup.end_time">1439499658000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="dbs-maxscale-core-prod-candidate config" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="checkQuery">show databases</stringProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">prodpool</stringProp>
          <stringProp name="dbUrl">jdbc:mysql://iplant-ssh.tacc.utexas.edu:3302/agave-api?sessionVariables=FOREIGN_KEY_CHECKS=0&amp;amp;relaxAutoCommit=true</stringProp>
          <stringProp name="driver">com.mysql.jdbc.Driver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">d3f@ult$</stringProp>
          <stringProp name="poolMax">50</stringProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">agaveapi</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <GenericController guiclass="LogicControllerGui" testclass="GenericController" testname="Simple Controller" enabled="true"/>
        <hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="only active jobs" enabled="false">
            <stringProp name="dataSource">mypool</stringProp>
            <stringProp name="query">select `last_updated`, `tenant_id`, `name`, `status`, `queue_request`, `software_name`, `uuid` from `jobs` where `execution_system` = &apos;stampede.tacc.utexas.edu&apos; and `owner` = &apos;vaughn&apos; and `status` in (&apos;CLEANING_UP&apos;, &apos;ARCHIVING&apos;, &apos;RUNNING&apos;, &apos;PAUSED&apos;, &apos;QUEUED&apos;, &apos;PENDING&apos;, &apos;STAGING_INPUTS&apos;, &apos;STAGING_JOB&apos;, &apos;SUBMITTING&apos;, &apos;PROCESSING_INPUTS&apos;, &apos;STAGED&apos;) order by `last_updated` ASC;</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list apps" enabled="true">
            <stringProp name="dataSource">prodpool</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from softwares;		</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list systems" enabled="true">
            <stringProp name="dataSource">prodpool</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from systems; 	</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list jobs" enabled="true">
            <stringProp name="dataSource">prodpool</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from jobs;		</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list monitors" enabled="true">
            <stringProp name="dataSource">prodpool</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from monitors;		</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list notifications" enabled="true">
            <stringProp name="dataSource">prodpool</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from notifications;		</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="list postits" enabled="true">
            <stringProp name="dataSource">prodpool</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from postits;		</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">clusterresults.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>